class tr:
    t1 = "Здраствуйте это бот для запланированной публикации постов от имени юзерботов"
    t2 = "Добавить юзербота"
    t3 = "Вернуться"
    t4 = "Введите api_id"
    t5 = "Введите api_hash"
    t6 = "Введите номер"
    t7 = "Введите код"
    t8 = "Введите пароль"
    t9 = "Юзер бот добавлен"
    t10 = "Введите ссылку каннала донера для вступления формата: https://..., или id каннала донера: -100..."
    t11 = "Введите ссылки для вступления формата: https://..., или id канналов : -100... через пробел"
    t12 = "Запустить юзерботов"
    t13 = "!Запущенны будут только те юзерботы которые ещё не были запущенны"
    t14 = "Запущен юзербот\n\nlast_id: {}\nfirst_name: {}"
    t15 = "Сохранить юзер бота ?"
    t16 = "Да"
    t17 = "Нет"
    t18 = "Изменить юзербота"
    t19 = "Что вы хотите изменить ?"
    t20 = "Донера"
    t21 = "Канналы"
    t22 = "Введите api_id юзербота"
    t23 = "userbot id: {}"
    t24 = """
Введите дату формата:
Номер
Ф2а
Канал донор 
Канал для публикации
"""
    t25 = "Юзер бот не добавлен"
    t26 = "Удалить системные сообщения"
    t27 = "Все юзербота запущенны"


    et1 = "Извините, но вы ввели не api_id"
    et2 = "Извините, но вы ввели не api_hash"
    et3 = "Подключение не удалось попробуйте снова"
    et4 = "Не удалось отправить код"
    et5 = "Проблемы при сохраниение юзер бота"
    et6 = "Код не вверный, или пользователь не авторизирован"
    et7 = "Пароль не вверный"
    et8 = "Вы ввели не ссылку и не id каннала донера"
    et9 = "Не удалось присоедениться к канналу донеру"
    et10 = "ЮзерБот не состоит в каннале донера"
    et11 = "Не удалось присоедениться к канналу: {}"
    et12 = "Не удалось присоедениться к канналам"
    et13 = "Пользователь не состоит в каннале: {}"
    et14 = f'Нет такого варианта ответа, нажите на кнопку "{t16}" или "{t17}"'
    et15 = "Юзербот не найден"
    et16 = f'Нет такого варианта ответа, нажите на кнопку "{t20}" или "{t21}"'
    et17 = "Извините, вы ввели слишком много параметров"
    et18 = "Извините, вы ввели слишком мало параметров"
    et19 = "Вы ввели не ссылку и не id каннала каннала"
    
    bt1 = [t2, t12, t26]
    bt2 = [t3]
    bt3 = [t16, t17]
    bt4 = [t20, t21]